Amiya200/stm32_water_tank/Core/Src/screen.c
    if (elapsed < DASH_PAGE1_TIME)
        dash_page = 0;
    else if (elapsed < (DASH_PAGE1_TIME + DASH_PAGE2_TIME))
        dash_page = 1;
    else if (elapsed < (DASH_PAGE1_TIME + DASH_PAGE2_TIME + DASH_PAGE3_TIME))
        dash_page = 2;
    else
    {
        dash_cycle_start = now;
        dash_page = 0;
    }

    /* =========================================================
       STABLE MODEL VALUES (NO RAW ADC)
       ========================================================= */
    uint8_t tankPercent = ModelHandle_GetTankLevelPercent();
    bool tankFull = ModelHandle_IsTankFull();
    bool motorOn  = Motor_GetStatus();
    DryFSMState dryState = ModelHandle_GetDryState();

    /* =========================================================
       MODE DETECTION
       ========================================================= */
    const char* mode;

    if (ModelHandle_IsRestartActive())
        mode = "RESTART";
    else if (ModelHandle_IsVoltageFault())
        mode = "VOLTERR";
    else if (ModelHandle_IsOverload())
        mode = "OVERLD ";
    else if (ModelHandle_IsUnderload())
        mode = "UNDERLD";
    else if (motorOn)
    {
        if (manualActive)         mode = "MANUAL ";
        else if (semiAutoActive)  mode = "SEMI   ";
        else if (timerActive)     mode = "TIMER  ";
        else if (countdownActive) mode = "COUNT  ";
        else if (twistActive)     mode = "TWIST  ";
        else if (autoActive)      mode = "AUTO   ";
        else                      mode = "RUNNING";
    }
    else
    {
        if (tankFull)             mode = "FULL   ";
        else if (autoActive)      mode = "AUTO WT";
        else if (timerActive)     mode = "TIMERWT";
        else if (countdownActive) mode = "CD WAIT";
        else if (manualActive)    mode = "MANUAL ";
        else                      mode = "READY  ";
    }

    /* =========================================================
       PAGE 0 – MAIN STATUS
       ========================================================= */
    if (dash_page == 0)
    {
        snprintf(l0, sizeof(l0), "%-7sM:%s %3d%%",
                 mode,
                 motorOn ? "ON" : "OFF",
                 tankPercent);

        /* ===== DRY RUN HAS HIGHEST PRIORITY ===== */

        if (dryState == DRY_FAULT)
        {
            snprintf(l1, sizeof(l1), "DRY RUN");
        }
        else if (dryState == DRY_WAITING)
        {
            /* Blink every 500ms */
            if ((now / 500) % 2)
                snprintf(l1, sizeof(l1), "DRY RUN");
            else
                snprintf(l1, sizeof(l1), "        ");
        }
        else if (tankFull)
        {
            snprintf(l1, sizeof(l1), "TANK FULL STOP");
        }
        else
        {
            const char *gw =
                (adcData.voltages[4] <= 0.01f) ? "YES" : "NO ";

            const char *dry =
                (adcData.voltages[5] <= 0.01f) ? "YES" : "NO ";

            snprintf(l1, sizeof(l1), "G.W:%s DRY:%s", gw, dry);
        }
    }

    /* =========================================================
       PAGE 1 – DATE & TIME
       ========================================================= */
    else if (dash_page == 1)
    {
        snprintf(l0, sizeof(l0), "Date:%02u-%02u-%02u",
                 time.dom,
                 time.month,
                 (uint8_t)(time.year % 100));

        snprintf(l1, sizeof(l1), "Time:%02u:%02u:%02u",
                 time.hour,
                 time.min,
                 time.sec);
    }

    /* =========================================================
       PAGE 2 – ELECTRICAL MONITOR
       ========================================================= */
    else
    {
        snprintf(l0, sizeof(l0), "V:%3.0fV  I:%3.1fA",
                 g_voltageV,
                 g_currentA);

        if (ModelHandle_IsOverload())
            snprintf(l1, sizeof(l1), "OVER LOAD!");
        else if (ModelHandle_IsUnderload())
            snprintf(l1, sizeof(l1), "UNDER LOAD!");
        else if (ModelHandle_IsVoltageFault())
            snprintf(l1, sizeof(l1), "VOLT ERROR!");
        else
            snprintf(l1, sizeof(l1), "Live Monitor");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}

static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;
    uint8_t row = 255;
    if      (menu_idx == menu_view_top)     row = 0;
    else if (menu_idx == menu_view_top + 1) row = 1;
    if (row <= 1)
    {
        lcd_put_cur(row,0);
        lcd_send_data(cursorVisible ? '>' : ' ');
    }
}
static void show_menu(void)
{
    char l0[17], l1[17];
    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top + 1)
        menu_view_top = menu_idx - 1;
    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    if (menu_view_top + 1 < MAIN_MENU_COUNT)
        snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);
    else
        snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0);
    lcd_line1(l1);
    draw_menu_cursor();
}
static void show_devset_menu(void)
{
    char l0[17], l1[17];
    if (devset_idx < devset_view_top)
        devset_view_top = devset_idx;
    else if (devset_idx > devset_view_top + 1)
        devset_view_top = devset_idx - 1;
    uint8_t idx0 = devset_view_top;
    uint8_t idx1 = devset_view_top + 1;
    char star0 = ' ';
    char star1 = ' ';
    if (idx0 == 0 && edit_settings_gap_s > 0)     star0 = '*';
    if (idx0 == 1 && edit_settings_retry > 0)     star0 = '*';
    if (idx0 == 2 && edit_settings_uv > 0)        star0 = '*';
    if (idx0 == 3 && edit_settings_ov > 0)        star0 = '*';
    if (idx0 == 4 && edit_settings_ol > 0)        star0 = '*';
    if (idx0 == 5 && edit_settings_ul > 0)        star0 = '*';
    if (idx0 == 6 && edit_settings_maxrun > 0)    star0 = '*';
    if (idx1 == 0 && edit_settings_gap_s > 0)     star1 = '*';
    if (idx1 == 1 && edit_settings_retry > 0)     star1 = '*';
    if (idx1 == 2 && edit_settings_uv > 0)        star1 = '*';
    if (idx1 == 3 && edit_settings_ov > 0)        star1 = '*';
    if (idx1 == 4 && edit_settings_ol > 0)        star1 = '*';
    if (idx1 == 5 && edit_settings_ul > 0)        star1 = '*';
    if (idx1 == 6 && edit_settings_maxrun > 0)    star1 = '*';
    if (idx0 < DEVSET_MENU_COUNT)
        snprintf(l0, sizeof(l0), "%c%c%-14.14s",
                 (devset_idx == idx0 ? '>' : ' '),
                 star0,
                 devset_menu_items[idx0]);
    else
        snprintf(l0, sizeof(l0), "                ");
    if (idx1 < DEVSET_MENU_COUNT)
        snprintf(l1, sizeof(l1), "%c%c%-14.14s",
                 (devset_idx == idx1 ? '>' : ' '),
                 star1,
                 devset_menu_items[idx1]);
    else
        snprintf(l1, sizeof(l1), "                ");
    lcd_line0(l0);
    lcd_line1(l1);
}
static void show_timer_slot_select(void)
{
    lcd_clear();
    int item1 = timer_page * 2;
    int item2 = item1 + 1;
    char l0[17], l1[17];
    if (item1 == 5) {
        snprintf(l0, sizeof(l0), "%c Back",
                 (currentSlot == 5 ? '>' : ' '));
    }
    else {
        snprintf(l0, sizeof(l0), "%c Timer %d",
                 (currentSlot == item1 ? '>' : ' '),
                 item1 + 1);
    }
    if (item2 <= 5)
    {
        if (item2 == 5) {
            snprintf(l1, sizeof(l1), "%c Back",
                     (currentSlot == 5 ? '>' : ' '));
        } else {
            snprintf(l1, sizeof(l1), "%c Timer %d",
                     (currentSlot == item2 ? '>' : ' '),
                     item2 + 1);
        }
    }
    else {
        snprintf(l1, sizeof(l1), "                ");
    }
    lcd_line0(l0);
    lcd_line1(l1);
}
static void show_edit_on_time(void)
{
    char title[17];
    snprintf(title, sizeof(title), "T%u On Time", (unsigned)(currentSlot + 1));
    lcd_line0(title);

    char buf[17];
    if (time_edit_field == 0)
        snprintf(buf, sizeof(buf), "[%02d]:%02d   Next>", edit_on_h, edit_on_m);
    else
        snprintf(buf, sizeof(buf), "%02d:[%02d]   Next>", edit_on_h, edit_on_m);

