Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 1) % 7);
            break;

        default:
            break;
    }
}

void decrease_edit_value(void)
{
    switch(ui)
    {
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0) {
                if (edit_on_h >= 5) edit_on_h -= 5;
                else edit_on_h = 0;
            } else {
                if (edit_on_m >= 5) edit_on_m -= 5;
                else edit_on_m = 0;
            }
            break;
        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) {
                if (edit_off_h >= 5) edit_off_h -= 5;
                else edit_off_h = 0;
            } else {
                if (edit_off_m >= 5) edit_off_m -= 5;
                else edit_off_m = 0;
            }
            break;
        case UI_TIMER_EDIT_GAP:
            if (edit_gap_min >= 5) edit_gap_min -= 5;
            else edit_gap_min = 0;
            break;
        case UI_AUTO_EDIT_GAP:
            if (edit_auto_gap_s >= 5) edit_auto_gap_s -= 5;
            else edit_auto_gap_s = 0;
            break;
        case UI_AUTO_EDIT_MAXRUN:
            if (edit_auto_maxrun_min >= 5) edit_auto_maxrun_min -= 5;
            else edit_auto_maxrun_min = 0;
            break;
        case UI_AUTO_EDIT_RETRY:
            if (edit_auto_retry >= 5) edit_auto_retry -= 5;
            else edit_auto_retry = 0;
            break;
        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s >= 5) edit_settings_gap_s -= 5;
            else edit_settings_gap_s = 0;
            break;
        case UI_SETTINGS_RETRY:
            if (edit_settings_retry >= 5) edit_settings_retry -= 5;
            else edit_settings_retry = 0;
            break;
        case UI_SETTINGS_OL:
            if (edit_settings_ol >= 5) edit_settings_ol -= 5;
            else edit_settings_ol = 0;
            break;
        case UI_SETTINGS_UL:
            if (edit_settings_ul >= 5) edit_settings_ul -= 5;
            else edit_settings_ul = 0;
            break;
        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun >= 15) edit_settings_maxrun -= 5;
            else edit_settings_maxrun = 0;
            break;
        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) {
                if (edit_time_hh >= 5) edit_time_hh -= 5;
                else edit_time_hh = 0;
            } else {
                if (edit_time_min >= 5) edit_time_min -= 5;
                else edit_time_min = 0;
            }
            break;
        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 6) % 7);
            break;

        default:
            break;
    }
}
static UiButton decode_button_press(void)
{
    bool sw[4] = {
        Switch_IsPressed(0),
        Switch_IsPressed(1),
        Switch_IsPressed(2),
        Switch_IsPressed(3)
    };
    uint32_t now = HAL_GetTick();
    UiButton out = BTN_NONE;
    for (int i = 0; i < 4; i++)
    {
        if (sw[i] && sw_press_start[i] == 0)
        {
            sw_press_start[i] = now;
            sw_long_issued[i] = false;
        }
        else if (!sw[i] && sw_press_start[i] != 0)
        {
            if (!sw_long_issued[i])
            {
                switch(i){
                    case 0: out = BTN_RESET;  break;
                    case 1: out = BTN_SELECT; break;
                    case 2: out = BTN_UP;     break;
                    case 3: out = BTN_DOWN;   break;
                }
            }
            sw_press_start[i] = 0;
            sw_long_issued[i] = false;
        }
        else if (sw[i] && !sw_long_issued[i])
        {
            if (now - sw_press_start[i] >= LONG_PRESS_MS)
            {
                sw_long_issued[i] = true;
                switch(i){
                    case 0: out = BTN_RESET_LONG;  break;
                    case 1: out = BTN_SELECT_LONG; break;
                    case 2: out = BTN_UP_LONG;     break;
                    case 3: out = BTN_DOWN_LONG;   break;
                }
            }
        }
    }
    return out;
}


void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    uint32_t now = HAL_GetTick();

    bool sw_up   = Switch_IsPressed(2);
    bool sw_down = Switch_IsPressed(3);

    /* =========================================================
       COUNTDOWN HOLD AUTO-INCREMENT
       ========================================================= */
    if (ui == UI_COUNTDOWN_EDIT_MIN)
    {
        if (sw_down)
        {
            if (countdown_hold_active &&
                (now - countdown_hold_timer >= 1000))
            {
                countdown_hold_timer = now;

                if (edit_countdown_min < 240)
                    edit_countdown_min++;

                screenNeedsRefresh = true;
            }
        }
        else
        {
            countdown_hold_active = false;
        }
    }

    /* =========================================================
       BACK KEY – STRUCTURED DEVICE FLOW
       ========================================================= */
    if (b == BTN_RESET)
    {
        switch (ui)
        {
            /* Deep setting screens → DEVSET MENU */
            case UI_SETTINGS_GAP:
            case UI_SETTINGS_RETRY:
            case UI_SETTINGS_UV:
            case UI_SETTINGS_OV:
            case UI_SETTINGS_OL:
            case UI_SETTINGS_UL:
            case UI_SETTINGS_MAXRUN:
            case UI_SETTINGS_PWRREST:
            case UI_SETTINGS_FACTORY:
            case UI_DEVSET_EDIT_DATE:
            case UI_DEVSET_EDIT_TIME:
            case UI_DEVSET_EDIT_DAY:
                ui = UI_DEVSET_MENU;
                break;

            /* Device setup → Main menu */
            case UI_DEVSET_MENU:
                ui = UI_MENU;
                break;

            /* Add device screens → Main menu */
            case UI_ADD_DEVICE_MENU:
            case UI_ADD_DEVICE_PAIR:
            case UI_ADD_DEVICE_REMOVE:
            case UI_ADD_DEVICE_PAIR_DONE:
            case UI_ADD_DEVICE_REMOVE_DONE:
                ui = UI_MENU;
                break;

            /* Countdown edit → Countdown screen */
            case UI_COUNTDOWN_EDIT_MIN:
                ui = UI_COUNTDOWN;
                break;

