Amiya200/stm32_water_tank/Core/Src/screen.c
            /* Countdown → Dash */
            case UI_COUNTDOWN:
                ui = UI_DASH;
                break;

            /* Main menu → Dash */
            case UI_MENU:
                ui = UI_DASH;
                break;

            /* Default fallback */
            default:
                ui = UI_DASH;
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       RESET CONFIRM SCREEN
       ========================================================= */
    if (ui == UI_RESET_CONFIRM)
    {
        switch (b)
        {
            case BTN_UP:
            case BTN_DOWN:
                reset_confirm_yes = !reset_confirm_yes;
                break;

            case BTN_SELECT:
                if (reset_confirm_yes)
                    ModelHandle_FactoryReset();
                ui = UI_DASH;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       NORMAL EDIT HOLD (250ms repeat except special modes)
       ========================================================= */
    if ((sw_up || sw_down) &&
        ui != UI_MENU &&
        ui != UI_DEVSET_MENU &&
        ui != UI_TIMER_SLOT_SELECT &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        ui != UI_COUNTDOWN_EDIT_MIN &&
        (now - last_repeat_time >= 250))
    {
        last_repeat_time = now;

        if (sw_up)   increase_edit_value();
        if (sw_down) decrease_edit_value();

        screenNeedsRefresh = true;
    }

    if (b == BTN_NONE)
        return;

    refreshInactivityTimer();

    /* =========================================================
       DASH SCREEN CONTROLS
       ========================================================= */
    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET:
                ModelHandle_StartRestart();
                break;

            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                break;

            case BTN_SELECT:
                if (!autoActive)
                    ModelHandle_StartAuto(edit_auto_gap_s,
                                          edit_auto_maxrun_min,
                                          edit_auto_retry);
                else
                    ModelHandle_StopAuto();
                break;

            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                menu_view_top = 0;
                break;

            case BTN_UP:
                if (!timerActive)
                    ModelHandle_StartTimerNearestSlot();
                else
                    ModelHandle_StopTimer();
                break;

            case BTN_UP_LONG:
                if (!semiAutoActive)
                    ModelHandle_StartSemiAuto();
                else
                    ModelHandle_StopSemiAuto();
                break;

            case BTN_DOWN:
                if (!countdownActive)
                {
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                    ui = UI_COUNTDOWN;
                }
                else
                {
                    ModelHandle_StopCountdown();
                }
                break;

            case BTN_DOWN_LONG:
                if (!countdownActive)
                {
                    edit_countdown_min = 1;
                    ui = UI_COUNTDOWN_EDIT_MIN;

                    if (edit_countdown_min < 240)
                        edit_countdown_min++;

                    countdown_hold_active = true;
                    countdown_hold_timer  = now;
                }
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       MAIN MENU
       ========================================================= */
    if (ui == UI_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
        {
            menu_select();
        }
        else if (b == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1)
        {
            menu_idx++;
        }
        else if (b == BTN_UP && menu_idx > 0)
        {
            menu_idx--;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       DEVICE SET MENU
       ========================================================= */
    if (ui == UI_DEVSET_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG)
        {
            menu_select();
        }
        else if (b == BTN_DOWN && devset_idx < DEVSET_MENU_COUNT - 1)
        {
            devset_idx++;
        }
        else if (b == BTN_UP && devset_idx > 0)
        {
            devset_idx--;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* =========================================================
       GENERIC EDIT HANDLING
       ========================================================= */
    if (ui != UI_DASH)
    {
        if (b == BTN_UP)
            increase_edit_value();
        else if (b == BTN_DOWN)
            decrease_edit_value();
        else if (b == BTN_SELECT)
            menu_select();

        screenNeedsRefresh = true;
        return;
    }
}

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    /* =========================================================
       CURSOR BLINK (ONLY FOR MAIN MENU)
       ========================================================= */
    bool cursorBlinkActive = (ui == UI_MENU);

    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS))
    {
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        draw_menu_cursor();
    }

    /* =========================================================
       WELCOME SCREEN AUTO TRANSITION
       ========================================================= */
    if (ui == UI_WELCOME && (now - lastLcdUpdateTime >= WELCOME_MS))
    {
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* =========================================================
       AUTO BACK TO DASH AFTER INACTIVITY
       ========================================================= */
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* =========================================================
       DASH & COUNTDOWN REFRESH EVERY 1 SECOND
       ========================================================= */
    if ((ui == UI_DASH || ui == UI_COUNTDOWN) &&
        (now - lastLcdUpdateTime >= 1000))
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* =========================================================
       SCREEN DRAW HANDLING
       ========================================================= */
    if (screenNeedsRefresh || ui != last_ui)
    {
        bool fullRefresh = (ui != last_ui);

        /* 🔥 STORE PREVIOUS PAGE FOR BACK NAVIGATION */
        if (ui != last_ui)
        {
            prev_ui = last_ui;
        }

        last_ui = ui;
        screenNeedsRefresh = false;

