Amiya200/stm32_water_tank/Core/Src/screen.c
        if (fullRefresh)
            lcd_clear();

        switch (ui)
        {
            case UI_WELCOME:              show_welcome();              break;
            case UI_DASH:                 show_dash();                 break;
            case UI_MENU:                 show_menu();                 break;
            case UI_TIMER_SLOT_SELECT:    show_timer_slot_select();    break;
            case UI_TIMER_EDIT_ON_TIME:   show_edit_on_time();         break;
            case UI_TIMER_EDIT_OFF_TIME:  show_edit_off_time();        break;
            case UI_TIMER_EDIT_DAYS:      show_timer_days();           break;
            case UI_TIMER_EDIT_GAP:       show_timer_gap();            break;
            case UI_TIMER_EDIT_ENABLE:    show_timer_enable();         break;
            case UI_TIMER_EDIT_SUMMARY:   show_timer_summary();        break;
            case UI_AUTO_MENU:            show_auto_menu();            break;
            case UI_AUTO_EDIT_GAP:        show_auto_gap();             break;
            case UI_AUTO_EDIT_MAXRUN:     show_auto_maxrun();          break;
            case UI_AUTO_EDIT_RETRY:      show_auto_retry();           break;
            case UI_SEMI_AUTO:            show_semi_auto();            break;
            case UI_TWIST:                show_twist();                break;
            case UI_TWIST_EDIT_ON:        show_twist_on_sec();         break;
            case UI_TWIST_EDIT_OFF:       show_twist_off_sec();        break;
            case UI_TWIST_EDIT_ON_H:      show_twist_on_h();           break;
            case UI_TWIST_EDIT_ON_M:      show_twist_on_m();           break;
            case UI_TWIST_EDIT_OFF_H:     show_twist_off_h();          break;
            case UI_TWIST_EDIT_OFF_M:     show_twist_off_m();          break;
            case UI_COUNTDOWN:            show_countdown();            break;
            case UI_COUNTDOWN_EDIT_MIN:   show_countdown_edit_min();   break;
            case UI_DEVSET_MENU:          show_devset_menu();          break;
            case UI_SETTINGS_GAP:         show_settings_gap();         break;
            case UI_SETTINGS_RETRY:       show_settings_retry();       break;
            case UI_SETTINGS_UV:          show_settings_uv();          break;
            case UI_SETTINGS_OV:          show_settings_ov();          break;
            case UI_SETTINGS_OL:          show_settings_ol();          break;
            case UI_SETTINGS_UL:          show_settings_ul();          break;
            case UI_SETTINGS_MAXRUN:      show_settings_maxrun();      break;
            case UI_SETTINGS_PWRREST:     show_settings_pwrrest();     break;
            case UI_SETTINGS_FACTORY:     show_settings_factory();     break;
            case UI_DEVSET_EDIT_DATE:     show_devset_edit_date();     break;
            case UI_DEVSET_EDIT_TIME:     show_devset_edit_time();     break;
            case UI_DEVSET_EDIT_DAY:      show_devset_edit_day();      break;
            case UI_ADD_DEVICE_MENU:        show_add_device_menu();        break;
            case UI_ADD_DEVICE_PAIR:        show_add_device_pair();        break;
            case UI_ADD_DEVICE_REMOVE:      show_add_device_remove();      break;
            case UI_ADD_DEVICE_PAIR_DONE:   show_add_device_pair_done();   break;
            case UI_ADD_DEVICE_REMOVE_DONE: show_add_device_remove_done(); break;
            case UI_RESET_CONFIRM:        show_reset_confirm();        break;

            default:
                break;
        }
    }
}

extern void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry);
extern void ModelHandle_StartTimerNearestSlot(void);
extern void ModelHandle_StopTimer(void);
extern void ModelHandle_StopSemiAuto(void);
extern void ModelHandle_FactoryReset(void);
